import { RecruitmentDetailType } from '../../types/pageData';

export const RecruitDetails: RecruitmentDetailType[] = [
  {
    id: 'android',
    name: 'Android Developer',
    skill: 'Android',
    stack: 'JAVA, Kotlin',
    people:
      '코딩에 대한 남다른 애정을 가지신 분\n' +
      '1년이상 활동이 가능하신 분\n' +
      '책임감이 있으신 분\n' +
      '주도적으로 의견을 얘기하거나 반박하는데 거리낌이 없으신 분\n' +
      '동료들에게 좋은 시너지를 줄 수 있으신 분\n' +
      '타인의 의견을 적극적으로 수용하고 개선하려고 노력하시는 분\n' +
      '프로젝트의 애정과 책임을 가지고 주도적으로 개발, 개선할 수 있으신 분\n' +
      '커뮤니케이션 및 개발 문서 정리에 능숙하신 분\n' +
      '코딩에 대하여 잘 모르더라도 매일 학습하고, 모르는 게 있으면 주도적으로 해결할 수 있으신 분',
    plus:
      'Github, git에 대한 경험이나 프로젝트 경험이 있는 분\n' +
      'Framework나 Library 사용이 능숙하신 분\n' +
      'Android, Kotlin 개발 경험이 있으신 분\n' +
      'Android 의 다양한 Framework 나 Library 사용이 능숙하신 분\n' +
      '프로젝트의 아키텍쳐에 대한 고려를 끊임 없이 하시는 분',
    introduction:
      '진로가 안드로이드 개발자이신 분들을 위해 개설되었어요.\n' +
      '동료 개발자와 협업하거나 열정적인 분들과 함께 성장해나가고 싶은 분들은 환영해요.',
    activity:
      '2주마다 있는 정기세션에 참여할 수 있어요.\n' +
      'GDSC KOR나 GDSC DJU가 기획 및 운영하는 이벤트에 운영진으로 참여할 수 있어요.\n' +
      '팀리더로서 프로젝트나 스터디를 개설하거나 프로젝트에 안드로이드 포지션으로 합류할 수 있어요.',
  },
  {
    id: 'frontend',
    name: 'Frontend Developer',
    skill: 'React',
    stack: 'JavaScript, JSX, TypeScript',
    people:
      '코딩에 대한 남다른 애정을 가지신 분\n' +
      '1년이상 활동이 가능하신 분\n' +
      '책임감이 있으신 분\n' +
      '주도적으로 의견을 얘기하거나 반박하는데 거리낌이 없으신 분\n' +
      '동료들에게 좋은 시너지를 줄 수 있으신 분\n' +
      '타인의 의견을 적극적으로 수용하고 개선하려고 노력하시는 분\n' +
      '프로젝트의 애정과 책임을 가지고 주도적으로 개발, 개선할 수 있으신 분\n' +
      '커뮤니케이션 및 개발 문서 정리에 능숙하신 분\n' +
      '코딩에 대하여 잘 모르더라도 매일 학습하고, 모르는 게 있으면 주도적으로 해결할 수 있으신 분\n' +
      '코딩에 진심이신 분\n' +
      '의견 전달이나 수용에 거리낌이 없으신 분\n' +
      '더 좋은 커뮤니티나 팀문화에 대해 관심이 많으신 분',
    plus:
      'Github, git에 대한 경험이나 프로젝트 경험이 있는 분 \n' +
      'Framework나 Library 사용이 능숙하신 분 \n' +
      'React나 Vue 등 SPA에 대한 이해도가 있으신 분 ',
    activity:
      '2주마다 있는 정기세션에 참여할 수 있어요.\n' +
      'GDSC KOR나 GDSC DJU가 기획 및 운영하는 이벤트에 운영진으로 참여할 수 있어요.\n' +
      '팀리더로서 프로젝트나 스터디를 개설하거나 프로젝트에 프론트엔드 포지션으로 합류할 수 있어요.\n' +
      'GDSC DJU 사이트의 성능개선을 진행하거나 사이트의 신규기능(백오피스) 등을 개발하는 프로젝트에 합류할 수 있어요.',
    introduction:
      '진로가 프론트엔드 개발자이신 분들을 위해 개설되었어요.\n' +
      '동료 개발자와 협업하거나 열정적인 분들과 함께 성장해나가고 싶은 분들은 환영해요.',
  },
  {
    id: 'backend',
    name: 'Backend Developer',
    skill: 'Spring, Spring Boot',
    stack: 'JAVA',
    people:
      '코딩에 대한 남다른 애정을 가지신 분\n' +
      '1년이상 활동이 가능하신 분\n' +
      '책임감이 있으신 분\n' +
      '주도적으로 의견을 얘기하거나 반박하는데 거리낌이 없으신 분\n' +
      '동료들에게 좋은 시너지를 줄 수 있으신 분\n' +
      '타인의 의견을 적극적으로 수용하고 개선하려고 노력하시는 분\n' +
      '프로젝트의 애정과 책임을 가지고 주도적으로 개발, 개선할 수 있으신 분\n' +
      '커뮤니케이션 및 개발 문서 정리에 능숙하신 분\n' +
      '코딩에 대하여 잘 모르더라도 매일 학습하고, 모르는 게 있으면 주도적으로 해결할 수 있으신 분\n' +
      '팀 프로젝트 경험이 있으신 분\n' +
      'API 개발 경험 있으신 분\n' +
      '백엔드 개발에 관심이 많으신 분',
    plus:
      'Github, git에 대한 경험이나 프로젝트 경험이 있는 분 \n' +
      'Framework나 Library 사용이 능숙하신 분 \n' +
      '데이터베이스 구축 경험 있으신 분 \n' +
      '스프링 관련 프로젝트 경험이 있으신 분 \n' +
      '최신 개발 트렌드에 관심이 많으신 분 ',
    introduction:
      '진로가 백엔드 개발자이신 분들을 위해 개설되었어요.\n' +
      '동료 개발자와 협업하거나 열정적인 분들과 함께 성장해나가고 싶은 분들은 환영해요.',
    activity:
      '2주마다 있는 정기세션에 참여할 수 있어요.\n' +
      'GDSC KOR나 GDSC DJU가 기획 및 운영하는 이벤트에 운영진으로 참여할 수 있어요.\n' +
      '팀리더로서 프로젝트나 스터디를 개설하거나 프로젝트에 백엔드 포지션으로 합류할 수 있어요.',
  },
  {
    id: 'ml',
    name: 'Machine Learning Engineer',
    skill: 'Open CV',
    stack: '',
    people:
      '코딩에 대한 남다른 애정을 가지신 분\n' +
      '1년이상 활동이 가능하신 분\n' +
      '책임감이 있으신 분\n' +
      '주도적으로 의견을 얘기하거나 반박하는데 거리낌이 없으신 분\n' +
      '동료들에게 좋은 시너지를 줄 수 있으신 분\n' +
      '타인의 의견을 적극적으로 수용하고 개선하려고 노력하시는 분\n' +
      '프로젝트의 애정과 책임을 가지고 주도적으로 개발, 개선할 수 있으신 분\n' +
      '커뮤니케이션 및 개발 문서 정리에 능숙하신 분\n' +
      '코딩에 대하여 잘 모르더라도 매일 학습하고, 모르는 게 있으면 주도적으로 해결할 수 있으신 분\n' +
      '머신 러닝 알고리즘에 대한 기본기를 갖추신 분\n' +
      '오픈소스를 활용한 모델의 학습 및 개선 경험이 있으신 분',
    plus:
      'Github, git에 대한 경험이나 프로젝트 경험이 있는 분 \n' +
      'Framework나 Library 사용이 능숙하신 분 \n' +
      '인공지능 기술을 활용한 프로젝트를 주도적으로 진행한 경험이 있는 분 \n' +
      'AWS 등을 이용한 머신러닝 서비스 개발 및 배포 경험이 있는 분 \n' +
      '최소 하나 이상의 ML 라이브러리(sklearn, TensorFlow, OpenCV 등)를 익숙하게 활용하실 수 있으신 분 ',
    introduction:
      '진로가 머신러닝 엔지니어이신 분들을 위해 개설되었어요.\n' +
      '동료 개발자와 협업하거나 프로젝트를 진행하는 경험을 얻고 싶은 분들은 환영해요.\n' +
      '머신러닝 포지션은 지원자가 많지 않아요. 머신러닝 포지션 리드를 맡고 싶으신 분은 지원서에 언급부탁드려요.',
    activity:
      '2주마다 있는 정기세션에 참여할 수 있어요.\n' +
      'GDSC KOR나 GDSC DJU가 기획 및 운영하는 이벤트에 운영진으로 참여할 수 있어요.\n' +
      '팀리더로서 프로젝트나 스터디를 개설하거나 프로젝트에 머신러닝 포지션으로 합류할 수 있어요.',
  },
  {
    id: 'design',
    name: 'UX/UI Designer',
    skill: 'UX/UI',
    stack: 'Figma, Adobe XD, Framer',
    people:
      'UX/UI 디자인에 대한 남다른 애정을 가지신 분\n' +
      '1년이상 활동이 가능하신 분\n' +
      '책임감이 있으신 분\n' +
      '주도적으로 의견을 얘기하거나 반박하는데 거리낌이 없으신 분\n' +
      '동료들에게 좋은 시너지를 줄 수 있으신 분\n' +
      '타인의 의견을 적극적으로 수용하고 개선하려고 노력하시는 분\n' +
      '프로젝트의 애정과 책임을 가지고 주도적으로 개발, 개선할 수 있으신 분\n' +
      '커뮤니케이션 및 문서 정리에 능숙하신 분\n' +
      '디자인에 대하여 잘 모르더라도 매일 학습하고, 모르는 게 있으면 주도적으로 해결할 수 있으신 분\n' +
      'AdobeXD, Figma, Sketch등 디자인 툴 사용경험이 있는 분\n' +
      'UX,UI 을 고려한 디자인을 진행해 본 경험이 있는 분',
    plus:
      '협업 및 프로젝트 경험이 있는 분 \n' +
      '개발자와 협업 경험이 있는 분 \n' +
      'MarkUp(HTML)언어를 사용할 줄 아시는 분 ',
    introduction:
      '진로가 UX/UI 디자이너이신 분들을 위해 개설되었어요.\n' +
      '개발자와 협업하거나 동료 디자이너와 협업하고 싶은 분들은 환영해요.',
    activity:
      '2주마다 있는 정기세션에 참여할 수 있어요.\n' +
      'GDSC KOR나 GDSC DJU가 기획 및 운영하는 이벤트에 운영진으로 참여할 수 있어요.\n' +
      '팀리더로서 프로젝트나 스터디를 개설하거나 프로젝트에 디자이너 포지션으로 합류할 수 있어요.',
  },
  {
    id: 'beginner',
    name: 'Beginner',
    skill: 'none',
    stack: 'none',
    people:
      '코딩에 대한 남다른 애정을 가지신 분\n' +
      '1년이상 활동이 가능하신 분\n' +
      '책임감이 있으신 분\n' +
      '주도적으로 의견을 얘기하거나 반박하는데 거리낌이 없으신 분\n' +
      '동료들에게 좋은 시너지를 줄 수 있으신 분\n' +
      '타인의 의견을 적극적으로 수용하고 개선하려고 노력하시는 분\n' +
      '프로젝트의 애정과 책임을 가지고 주도적으로 개발, 개선할 수 있으신 분\n' +
      '커뮤니케이션 및 개발 문서 정리에 능숙하신 분\n' +
      '코딩에 대하여 잘 모르더라도 매일 학습하고, 모르는 게 있으면 주도적으로 해결할 수 있으신 분\n' +
      '코딩에 관심은 있으나 혼자 시작하기 막막하신 분\n' +
      '여러가지 시도해본 경험은 있으나 더 많은 경험을 원하시는 분',
    plus:
      '코딩에 대하여 잘 모르더라도 매일 학습할 의지가 있으신 분 \n' +
      'Github에 대한 경험이 있으신 분이면 좋습니다',
    introduction:
      '비기너 포지션은 아직 진로가 명확하지 않은 분을 위해 개설되었어요.\n' +
      '꼭 진로가 개발자가 아니더라도 코딩에 애정이 있는 분들이라면 환영해요.',
    activity:
      '2주마다 있는 정기세션에 참여할 수 있어요.\n' +
      'GDSC KOR나 GDSC DJU가 기획 및 운영하는 이벤트에 운영진으로 참여할 수 있어요.\n' +
      '팀리더로서 스터디를 개설하거나 스터디에 팀원으로 참여할 수 있어요.\n' +
      '프로젝트에 비기너 포지션으로 합류할 수 있어요.',
  },
];
